/*task-1
დაწერეთ if პირობა, თუ ცვლადის მნიშვნელობა ნაკლებია 50ზე დაუბეჭდოს - ნაკლებია 50ზე, თუ ცვლადის მნიშვნელობა მეტია 20ზე დაიბეჭდოს მეტია 20ზე, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - შეცდომა.*/

let x = 100;
if (x < 50) {
    console.log(`${x} is less then 50`);
}
if (x > 20 ) {
     console.log(`${x} is more then 20`);
} else {
     console.log(`Error`);
}

/*Task 2  მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. ახალი if ის სინტაქსით დაწერეთ, 
თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true,
 ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; */
let firstName = "Mariam";
console.log(firstName == "Mariam" ? true : false);
/*task-3 მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. switch case ის საშუალებით დაწერეთ, 
თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true,ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; 
*/
/*task-4 ციკლის საშუალებით გამოიტანეთ რიცხვები 5დან - 100მდე*/

for (let i = 5; i < 100; i++){
    console.log(i)
}
/*task 5 მოცემულია მასივი:
let array1= [1, 2, 4, -. 1, -3, 8, 7, 0, -5, 18, 12];
ციკლის საშუალებით გამოიტანეთ მხოლოდ ის რიცხვები რომლებიც მეტია 0 ზე და ნაკლებია 10ზე
*/
let array1 = [1, 2, 4, -0.1, -3, 8, 7, 0, -5, 18, 12];
/*task 6 -თუ უსერის ასაკი ნაკლებია 18ზე და სტუდენტის სტატუსი აქტიურია დაიბეჭდოს ტექსტი:  hello user;
თუ უსერის სახელი უდრის ლევანს მაშინ დაიბეჭდოს ტექსტი: hello levani;
თუ უსერის სტუდენტის სტატუსი აქტიურია ან უსერის ასაკი ნაკლებია 25ზე დაიბეჭდოს ტექსტი: hello anna;
ყველა დანარჩენ შემთხვევაში დაილოგოს ტექსტი: error;
*/
let user2 = {
    name: 'anna',
    age: 20,
    studentstatus:'active'
}
/*Task 7  მოცემულია მასივი:
let array6 = [ 2, 3, 5, 10,25,24,11, 100 , 6,7, 10 ]
ამოიღეთ მხოლოდ ლუწი რიცხვები
*/
/*task 8* კონსოლში გამოიტანეთ მარტო ის ობიექტი, რომლის status property-ის მნიშვნელობა არის true;*/
let users = [
    {username: 'giorgi', status: false},
    {username: 'levani', status: false},
    {username: 'anna', status: true}
]
